import{a as s}from"./index-C4toX4Vu.js";const t={},g=`<div>
    마이크로소프트가 윈도우 운영체제에 인터넷 익스플로러(Internet Explorer)라는 웹 브라우저를 기본으로 탑재하기 시작하면서
    점유율이 엄청나게 증가하기 시작했습니다. 전체 사용률의 95%를 차지할 정도로 엄청났죠.
    이 때문에 당시 웹 개발자들은 대부분 익스플로러에 맞춰서 웹 사이트를 개발해야 했습니다.
    그런데 시간이 지나면서 다양한 웹 브라우저가 등장했음에도 익스플로러가 웹 표준을 무시하고 독단적인 행보를
    보이기 시작합니다. 이 때문에 개발자들은 크로스 브라우징(cross browsing) 이슈를 겪게 됩니다.
    즉, 동일한 코드인데도 익스플로러에서만 다르게 동작하는 것입니다.
    이로 인해 익스플로러는 개발자 사이에서 공공의 적과 같은 존재가 됐습니다
</div>
<br />
<figure>
    <img src="/assets/courses/qkmqd/hufwn/cuegf/ie.svg" class="w-100" alt="인터넷 익스플로러의 독자적인 행보" />
    <figcaption>인터넷 익스플로러의 독단적인 행보</figcaption>
</figure>
<br />
<div>
    그러던 중 2008년도에 구글에서 크롬이라는 웹 브라우저를 출시했는데요, 이 웹 브라우저의 사용률이 점점 증가하기 시작했습니다.
    왜냐하면 크롬이 다른 웹 브라우저에 비해 더 빠르고 가벼운 웹 경험을 제공했기 때문입니다.
    그리고 개발자들은 이러한 변화를 크게 환영했습니다.
    이는 구글 크롬이 익스플로러와 달리 웹 표준을 준수했고 강력한 개발자 도구를 제공했기 때문입니다.
</div>
<br />
<figure>
    <img src="/assets/courses/qkmqd/hufwn/cuegf/race.svg" class="w-100" alt="구글 크롬을 응원하는 개발자들" />
    <figcaption>구글 크롬을 응원하는 개발자들</figcaption>
</figure>
<br />
<div>
    그렇게 시간이 흐르면서 구글 크롬은 전 세계에서 가장 많이 사용하는 웹 브라우저가 되었고,
    익스플로러는 다른 웹 브라우저에 점점 밀려 사용률이 감소하면서 2022년 6월 15일에 지원 종료되었습니다.
    이제 구글 크롬이 독주하는 시대가 열리게 된 것입니다.
</div>
<br />
<div>
    이번 챕터에서는 이러한 구글 크롬 등을 설치하여 프론트엔드 개발을 위한 환경 세팅 작업을 진행하겠습니다.
</div>`,o=`<div>\r
    마이크로소프트가 윈도우 운영체제에 인터넷 익스플로러(Internet Explorer)라는 웹 브라우저를 기본으로 탑재하기 시작하면서\r
    점유율이 엄청나게 증가하기 시작했습니다. 전체 사용률의 95%를 차지할 정도로 엄청났죠.\r
    이 때문에 당시 웹 개발자들은 대부분 익스플로러에 맞춰서 웹 사이트를 개발해야 했습니다.\r
    그런데 시간이 지나면서 다양한 웹 브라우저가 등장했음에도 익스플로러가 웹 표준을 무시하고 독단적인 행보를\r
    보이기 시작합니다. 이 때문에 개발자들은 크로스 브라우징(cross browsing) 이슈를 겪게 됩니다.\r
    즉, 동일한 코드인데도 익스플로러에서만 다르게 동작하는 것입니다.\r
    이로 인해 익스플로러는 개발자 사이에서 공공의 적과 같은 존재가 됐습니다\r
</div>\r
<br />\r
<figure>\r
    <img src="/assets/courses/qkmqd/hufwn/cuegf/ie.svg" class="w-100" alt="인터넷 익스플로러의 독자적인 행보" />\r
    <figcaption>인터넷 익스플로러의 독단적인 행보</figcaption>\r
</figure>\r
<br />\r
<div>\r
    그러던 중 2008년도에 구글에서 크롬이라는 웹 브라우저를 출시했는데요, 이 웹 브라우저의 사용률이 점점 증가하기 시작했습니다.\r
    왜냐하면 크롬이 다른 웹 브라우저에 비해 더 빠르고 가벼운 웹 경험을 제공했기 때문입니다.\r
    그리고 개발자들은 이러한 변화를 크게 환영했습니다.\r
    이는 구글 크롬이 익스플로러와 달리 웹 표준을 준수했고 강력한 개발자 도구를 제공했기 때문입니다.\r
</div>\r
<br />\r
<figure>\r
    <img src="/assets/courses/qkmqd/hufwn/cuegf/race.svg" class="w-100" alt="구글 크롬을 응원하는 개발자들" />\r
    <figcaption>구글 크롬을 응원하는 개발자들</figcaption>\r
</figure>\r
<br />\r
<div>\r
    그렇게 시간이 흐르면서 구글 크롬은 전 세계에서 가장 많이 사용하는 웹 브라우저가 되었고,\r
    익스플로러는 다른 웹 브라우저에 점점 밀려 사용률이 감소하면서 2022년 6월 15일에 지원 종료되었습니다.\r
    이제 구글 크롬이 독주하는 시대가 열리게 된 것입니다.\r
</div>\r
<br />\r
<div>\r
    이번 챕터에서는 이러한 구글 크롬 등을 설치하여 프론트엔드 개발을 위한 환경 세팅 작업을 진행하겠습니다.\r
</div>`;function i(n,r){return r[0]||(r[0]=s('<div> 마이크로소프트가 윈도우 운영체제에 인터넷 익스플로러(Internet Explorer)라는 웹 브라우저를 기본으로 탑재하기 시작하면서 점유율이 엄청나게 증가하기 시작했습니다. 전체 사용률의 95%를 차지할 정도로 엄청났죠. 이 때문에 당시 웹 개발자들은 대부분 익스플로러에 맞춰서 웹 사이트를 개발해야 했습니다. 그런데 시간이 지나면서 다양한 웹 브라우저가 등장했음에도 익스플로러가 웹 표준을 무시하고 독단적인 행보를 보이기 시작합니다. 이 때문에 개발자들은 크로스 브라우징(cross browsing) 이슈를 겪게 됩니다. 즉, 동일한 코드인데도 익스플로러에서만 다르게 동작하는 것입니다. 이로 인해 익스플로러는 개발자 사이에서 공공의 적과 같은 존재가 됐습니다 </div><br><figure><img src="/assets/courses/qkmqd/hufwn/cuegf/ie.svg" class="w-100" alt="인터넷 익스플로러의 독자적인 행보"><figcaption>인터넷 익스플로러의 독단적인 행보</figcaption></figure><br><div> 그러던 중 2008년도에 구글에서 크롬이라는 웹 브라우저를 출시했는데요, 이 웹 브라우저의 사용률이 점점 증가하기 시작했습니다. 왜냐하면 크롬이 다른 웹 브라우저에 비해 더 빠르고 가벼운 웹 경험을 제공했기 때문입니다. 그리고 개발자들은 이러한 변화를 크게 환영했습니다. 이는 구글 크롬이 익스플로러와 달리 웹 표준을 준수했고 강력한 개발자 도구를 제공했기 때문입니다. </div><br><figure><img src="/assets/courses/qkmqd/hufwn/cuegf/race.svg" class="w-100" alt="구글 크롬을 응원하는 개발자들"><figcaption>구글 크롬을 응원하는 개발자들</figcaption></figure><br><div> 그렇게 시간이 흐르면서 구글 크롬은 전 세계에서 가장 많이 사용하는 웹 브라우저가 되었고, 익스플로러는 다른 웹 브라우저에 점점 밀려 사용률이 감소하면서 2022년 6월 15일에 지원 종료되었습니다. 이제 구글 크롬이 독주하는 시대가 열리게 된 것입니다. </div><br><div> 이번 챕터에서는 이러한 구글 크롬 등을 설치하여 프론트엔드 개발을 위한 환경 세팅 작업을 진행하겠습니다. </div>',11))}const e={render:i};e.__hmrId="C:/J/repositories/africalib/src/data/courses/qkmqd/hufwn/cuegf.md";const a=n=>({components:n,render:i});export{e as VueComponent,a as VueComponentWith,t as attributes,g as html,o as markdown};
